API/GetFlight_API/Report/Res2/Report/Data/Step2.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity4</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_InputXml_c0074dbf-121a-472f-8aeb-7bb4890ea84d.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;Body&gt;
    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
      &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
      &lt;FlightDate&gt;2025-12-31T00:00:00+00:00&lt;/FlightDate&gt;
    &lt;/GetFlights&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">Flights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">GetFlights</Operation><Address name="Address">http://localhost:8000/Flights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity4_Full_request_224d0287-7187-4a6b-a3ad-3ffcb17480e9.xml">&lt;?xml version="1.0"? ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights
Content-Type:	text/xml; charset=utf-8
Host:	localhost:8000
Content-Length:	260
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	3364
Content-Type:	text/xml; charset=utf-8
Date:	Mon, 12 May 2025 13:29:11 GMT
Server:	Microsoft-HTTPAPI/2.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:06 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:09 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;2880&lt;/FlightNumber&gt;&lt;Price&gt;134.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:43 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;01:45 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3019&lt;/FlightNumber&gt;&lt;Price&gt;124&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;07:31 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;06:33 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3740&lt;/FlightNumber&gt;&lt;Price&gt;126.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:55 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;02:57 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4661&lt;/FlightNumber&gt;&lt;Price&gt;107.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;12:18 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;11:21 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4777&lt;/FlightNumber&gt;&lt;Price&gt;110.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:31 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:33 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6142&lt;/FlightNumber&gt;&lt;Price&gt;121.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:30 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:10 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6305&lt;/FlightNumber&gt;&lt;Price&gt;295&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;UA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:50 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;11:30 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6306&lt;/FlightNumber&gt;&lt;Price&gt;255&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;UA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;05:00 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;01:00 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6307&lt;/FlightNumber&gt;&lt;Price&gt;245&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;06:00 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:00 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6308&lt;/FlightNumber&gt;&lt;Price&gt;230&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:30 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;07:00 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6309&lt;/FlightNumber&gt;&lt;Price&gt;199&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;05:07 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;04:09 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;7574&lt;/FlightNumber&gt;&lt;Price&gt;136&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:42 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;07:45 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;8649&lt;/FlightNumber&gt;&lt;Price&gt;134.4&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_OutputXml_23e49a01-74ec-41d0-847c-53f761ab7388.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;11:06 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;10:09 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;2880&lt;/FlightNumber&gt;
          &lt;Price&gt;134.8&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;02:43 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;01:45 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3019&lt;/FlightNumber&gt;
          &lt;Price&gt;124&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;07:31 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;06:33 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3740&lt;/FlightNumber&gt;
          &lt;Price&gt;126.8&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;03:55 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;02:57 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;4661&lt;/FlightNumber&gt;
          &lt;Price&gt;107.2&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;12:18 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;11:21 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;4777&lt;/FlightNumber&gt;
          &lt;Price&gt;110.8&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;01:31 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:33 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6142&lt;/FlightNumber&gt;
          &lt;Price&gt;121.2&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;01:30 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;10:10 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6305&lt;/FlightNumber&gt;
          &lt;Price&gt;295&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;UA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;02:50 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;11:30 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6306&lt;/FlightNumber&gt;
          &lt;Price&gt;255&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;UA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;05:00 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;01:00 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6307&lt;/FlightNumber&gt;
          &lt;Price&gt;245&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;06:00 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:00 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6308&lt;/FlightNumber&gt;
          &lt;Price&gt;230&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;10:30 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;07:00 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6309&lt;/FlightNumber&gt;
          &lt;Price&gt;199&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;05:07 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;04:09 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;7574&lt;/FlightNumber&gt;
          &lt;Price&gt;136&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;08:42 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;07:45 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;8649&lt;/FlightNumber&gt;
          &lt;Price&gt;134.4&lt;/Price&gt;
        &lt;/Flight&gt;
      &lt;/GetFlightsResult&gt;
    &lt;/GetFlightsResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'GetFlights'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>